package com.company;

public class TaskC {
//    Ответьте на вопросы своими словами:
//
//            1. Как вы понимаете исключения(exception)?
//              исключение ошибок не зависящих от нас
//
//            2. Какие исключения вы встречали?
//              IOException
//
//            3. Что вы знаете о классе Exception
//
//
//            4. Что будет если не обработать исключение?
//                 код не будет работать
//
//            5. Объясните, как работает структура try-catch
//              в try  пишем код в catch пишем exception.то же самое что и throws IOException.
}
